src/main/resources/customer.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
  <soap-env:Header>
    <wsa:To soap-env:mustUnderstand="1" xmlns:wsa="http://www.w3.org/2005/08/addressing">
      http://www.w3.org/2005/08/addressing/anonymous
    </wsa:To>
    <wsa:From xmlns:wsa="http://www.w3.org/2005/08/addressing">
      <wsa:Address>ws://volkswagenag.com/Retail/BusinessPartnerManagementService/V1</wsa:Address>
    </wsa:From>
    <wsa:Action soap-env:mustUnderstand="1" xmlns:wsa="http://www.w3.org/2005/08/addressing">
      http://xmldefs.volkswagenag.com/Retail/BusinessPartnerManagementService/V1/BusinessPartnerManagementServicePortType/GetBusinessPartnerByIDResponse
    </wsa:Action>
    <wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">
      urn:uuid:005056a6-79d6-1eea-839a-c3caa039b0d2
    </wsa:MessageID>
    <wsa:RelatesTo xmlns:wsa="http://www.w3.org/2005/08/addressing">
      urn:uuid:9BEC41F0-94FC-4619-8F8C-D5BEDFBE
    </wsa:RelatesTo>
  </soap-env:Header>
  <soap-env:Body>
    <n0:ShowBusinessPartnerByID
      xmlns:n0="http://xmldefs.volkswagenag.com/Retail/BusinessPartnerManagementService/V1"
    >
      <n1:BusinessPartnerCompound xmlns:n1="http://xmldefs.volkswagenag.com/DD/BusinessPartner">
        <n1:PartnerIdentifier>
          <n1:ApplicationIdentifiers>
            <n1:ID schemeID="CRM">6002174499</n1:ID>
          </n1:ApplicationIdentifiers>
        </n1:PartnerIdentifier>
        <n1:Partner>
          <n1:PartnerKindChoice>
            <n1:PartnerKind>Person</n1:PartnerKind>
            <n1:Person>
              <n1:Salutation>Ms</n1:Salutation>
              <n1:Name>
                <n1:FirstName>test</n1:FirstName>
                <n1:LastName>夏</n1:LastName>
              </n1:Name>
              <n1:Languages>
                <n1:Language>
                  <n1:LanguageCode>ZH</n1:LanguageCode>
                </n1:Language>
              </n1:Languages>
            </n1:Person>
          </n1:PartnerKindChoice>
          <n1:Addresses>
            <n1:Address>
              <n1:AddressID schemeID="CRM">0012519763</n1:AddressID>
              <n1:IsStandardAddressIND>true</n1:IsStandardAddressIND>
              <n1:AddressKindChoice>
                <n1:AddressKind>StreetAddress</n1:AddressKind>
                <n1:StreetAddress>
                  <n1:Street>0009</n1:Street>
                  <n1:HouseNumber>00008</n1:HouseNumber>
                  <n1:PostalCode>241000</n1:PostalCode>
                  <n1:City>芜湖</n1:City>
                  <n1:State>110</n1:State>
                  <n1:Country>CN</n1:Country>
                </n1:StreetAddress>
              </n1:AddressKindChoice>
              <n1:Usages>
                <n1:Usage>
                  <n1:UsageType>HomeAddress</n1:UsageType>
                </n1:Usage>
              </n1:Usages>
            </n1:Address>
          </n1:Addresses>
          <n1:CommunicationChannels>
            <n1:CommunicationChannel>
              <n1:IsStandardIND>true</n1:IsStandardIND>
              <n1:ChannelTypeChoice>
                <n1:ChannelType>Phone</n1:ChannelType>
                <n1:Phone>
                  <n1:Number>+86900099887</n1:Number>
                  <n1:MobileIND>true</n1:MobileIND>
                </n1:Phone>
              </n1:ChannelTypeChoice>
              <n1:Usage>PrivateUsage</n1:Usage>
            </n1:CommunicationChannel>
          </n1:CommunicationChannels>
          <n1:InactiveStatus>
            <n1:InactiveIND>false</n1:InactiveIND>
          </n1:InactiveStatus>
          <n1:ProcessingInformation>
            <n1:Timestamps>
              <n1:LastChange>2019-11-22T01:48:03Z</n1:LastChange>
            </n1:Timestamps>
          </n1:ProcessingInformation>
          <n1:ControlData>
            <n1:ToBeArchivedIND>false</n1:ToBeArchivedIND>
          </n1:ControlData>
        </n1:Partner>
        <n1:CustomerDetails>
          <n1:MarketingAllowances>
            <n1:MarketingAllowance>
              <n1:GeneralMarketingAllowanceIND>false</n1:GeneralMarketingAllowanceIND>
              <n1:MarketingBlockades>
                <n1:MarketingBlockade>
                  <n1:BlockType>Email</n1:BlockType>
                  <n1:BlockedIND>false</n1:BlockedIND>
                </n1:MarketingBlockade>
                <n1:MarketingBlockade>
                  <n1:BlockType>Phone</n1:BlockType>
                  <n1:BlockedIND>false</n1:BlockedIND>
                </n1:MarketingBlockade>
                <n1:MarketingBlockade>
                  <n1:BlockType>Fax</n1:BlockType>
                  <n1:BlockedIND>false</n1:BlockedIND>
                </n1:MarketingBlockade>
                <n1:MarketingBlockade>
                  <n1:BlockType>Letter</n1:BlockType>
                  <n1:BlockedIND>false</n1:BlockedIND>
                </n1:MarketingBlockade>
                <n1:MarketingBlockade>
                  <n1:BlockType>Survey</n1:BlockType>
                  <n1:BlockedIND>false</n1:BlockedIND>
                </n1:MarketingBlockade>
                <n1:MarketingBlockade>
                  <n1:BlockType>SocialNetwork</n1:BlockType>
                  <n1:BlockedIND>false</n1:BlockedIND>
                </n1:MarketingBlockade>
                <n1:MarketingBlockade>
                  <n1:BlockType>Robinson</n1:BlockType>
                  <n1:BlockedIND>false</n1:BlockedIND>
                </n1:MarketingBlockade>
                <n1:MarketingBlockade>
                  <n1:BlockType>Nixi</n1:BlockType>
                  <n1:BlockedIND>false</n1:BlockedIND>
                </n1:MarketingBlockade>
                <n1:MarketingBlockade>
                  <n1:BlockType>GeneralBrandBlock</n1:BlockType>
                  <n1:BlockedIND>false</n1:BlockedIND>
                </n1:MarketingBlockade>
                <n1:MarketingBlockade>
                  <n1:BlockType>ComplaintBlock</n1:BlockType>
                  <n1:BlockedIND>false</n1:BlockedIND>
                </n1:MarketingBlockade>
                <n1:MarketingBlockade>
                  <n1:BlockType>BrandDealerBlock</n1:BlockType>
                  <n1:BlockedIND>false</n1:BlockedIND>
                </n1:MarketingBlockade>
                <n1:MarketingBlockade>
                  <n1:BlockType>ThirdPartyBlock</n1:BlockType>
                  <n1:BlockedIND>false</n1:BlockedIND>
                </n1:MarketingBlockade>
              </n1:MarketingBlockades>
            </n1:MarketingAllowance>
          </n1:MarketingAllowances>
        </n1:CustomerDetails>
      </n1:BusinessPartnerCompound>
    </n0:ShowBusinessPartnerByID>
  </soap-env:Body>
</soap-env:Envelope>